// const Sentiment = require('sentiment');
//
// let sen = new Sentiment();
//
// let result = sen.analyze(`
// 《寄生虫》是一部让我失望的电影。
//
// 我不喜欢“穷人的味道”这个符号，太刻意也太没有起作用。石头、披萨、虫子、杀虫剂、尿尿的男人，以及半地下室、地下室、豪宅这一系列符号，我觉得都没有使用好。不是太生硬，就是太强调，要不就是虎头蛇尾。
//
// 我不喜欢《寄生虫》所描摹的上层社会。上层社会不是这样的傻白甜。那么轻易地相信人，让高二的女儿跟年轻的男性补习老师独处一室；轻易地相信一个又一个的推荐；轻易地相信对老保姆的构陷。仿佛毫无社会经验，同时毫无生活能力。连找保姆这样的大事都需要等司机推荐。
//
// 上层社会的人拥有一个稳定的社交圈，他们不会轻易去信任工作人员。他们找保姆找家教，买衣服买酒，都会去寻求朋友的意见。他们会有固定消费的牌子，会有固定信任的服务机构。
//
// New Money或许没这么执拗，但是他们自己创下基业，生存能力之强，完全不会如此任人摆布。
//
// 我也不喜欢《寄生虫》所描摹的底层社会。底层社会没有这么强大的能力。可以帮人补习英语，可以轻松把调皮的小男孩搞定。可以开车开得很专业，可以做家政让女主人无可挑剔。底层之所以是底层，他们最缺的并不是钱，而是视野与精力。底层穷困的生活让人没有精力学习，没有精力思考，也很难去筹划未来。
//
// 所谓穷人的味道，不是一种气味，而是一种放弃的绝望，一种无能为力的窒息。可惜，《寄生虫》完全没有表达出来。
//
// 整部电影在我看来，是从老保姆雨夜按门铃开始垮掉的。
//
// 全家在主人的家中狂欢，这么危险的举动，怎么可以允许老保姆进来呢？编剧如果稍稍用心，这个问题其实很好解决。比如老保姆跟踪了他们一家，掌握了他们其实是一家人的证据，以此要挟进入别墅。然而电影让老保姆哀求了几句，就让这家人把自己置于危险之下。这不是善良，这是疯狂。
//
// 后来的一切，都显得相当不合理。一家三口偷听忽然摔下，满地的狼藉主人发现不了，地下室入口成了视野盲区……
//
// 种种的不合理缘于不诚恳。电影不能诚恳地面对这个世界，面对生活。电影给我的感觉是，找到了一个奇思，然后发展成为一部电影。那些符号用不着多加思考和设计，直给就好。
//
// 《寄生虫》甚至舍不得批判任何人。电影里的社长虽然自私，虽然嫌弃穷人的味道，然而他和妻子已经充分给予底层信任，给了丰厚的报酬，开除有错的员工都要找理由。他和妻子最多是冷漠的有钱人而已。
//
// 上层社会对底层的压榨是这样的吗？完全不是。
//
// 《燃烧》里面，上层社会用信用卡，用消费主义，甚至用学识和见闻，来压榨底层，让底层轻易成为玩腻后丢弃的玩具。做这一切的时候，上层的人们甚至没有意识，没有罪恶感。
//
// P2P爆雷的时候，你见过谁出来向受害者负责？烂尾楼的时候，你见过哪个开发商出来说明情况？环境污染了之后，你见过哪个厂商向村民道歉？
//
// 因为他们不觉得自己做错了什么。你掏光家产赌一个未来，他的回答是，投资有风险，愿赌服输。你倾尽全力去找一个工作，他告诉你，你应该做不惜一切代价的那个代价。
//
// 这才是阶层的鸿沟。
//
// 《寄生虫》对上流社会的描述，仿佛挑夫说皇帝一定用的是金扁担。
//
// 《寄生虫》也舍不得批判底层。
//
// 底层的生活情况是这样吗？不要说去生活，去接触，只要看看那些纪录片，就知道不是这样的。徐童的《游民》三部曲，范立欣的《归途列车》，NHK的《三和人才市场》。生存资源实在太过匮乏，人脉实在太过狭窄。底层的生活充满了狡黠、欺骗、温暖和伤害。
//
// 他们实在不可能掌握那么多的技能，他们也实在不知道如何和上层社会打交道。《孝子洞理发师》里，一家人去参加总统的家宴，不知所措才是唯一可能的表达方式。哪里能像《寄生虫》那样游刃有余。
//
// 《寄生虫》对底层生活的描述，仿佛又在说何不食肉糜。
//
// 我幻想，如果《寄生虫》用魔幻现实主义的手法，这一家人真的是不停地寄生，他们吞噬一个又一个宿主，然后成为主人，消耗掉所有的资源以后又再寻找下一个猎物，那就好玩了。
//
// 因为我看到电影开头，一家人被杀虫剂熏得受不了，真的好期待他们体内的寄生虫爬出来。`);
//
// console.log(result);
